# LIVE Coding PAndas

In [1]:
import pandas as pd
import numpy as np
import datetime as d

In [53]:
df = pd.read_table("http://bit.ly/movieusers", sep="|",
                   header=None,
                   names=["index", "age", "sexe", "metier", "matricule"],
                   index_col="index")

In [ ]:
df.tail(10)

In [16]:
df.head(10)

       age sexe         metier matricule
index
1       24    M     technician     85711
2       53    F          other     94043
3       23    M         writer     32067
4       24    M     technician     43537
5       33    F          other     15213
6       42    M      executive     98101
7       57    M  administrator     91344
8       36    M  administrator     05201
9       29    M        student     01002
10      53    M         lawyer     90703

In [ ]:
df.shape

In [ ]:
df.describe()

In [ ]:

df.shapedf.describe().loc["age"]

In [ ]:
df[["age", "sexe"]]

In [ ]:

# indice location
df.iloc[0]

In [ ]:
#  meme resultat avec
df.iloc[0, :]

In [ ]:
#  1 ligne
df.iloc[1, :]

In [ ]:
#  de 0 Ã  5
df.iloc[0:5, 1]

In [ ]:
#  avec location
df.loc[2:5, "sexe"]

In [ ]:
df["age"].dtype()
# autre solution
df.age.dtypes

In [ ]:
df
age = df.age.astype("float")

In [ ]:
# creer une nouvelle colonne
annee_actuelle = d.datetime.now().year
df["date_de naissance"] = annee_actuelle-df["age"]

In [ ]:

# boucle
for index, ligne in df.iterrows:
    print(index, ":", ligne.age, ligne.metier, ligne.sexe)

In [ ]:

# autre solution boucle
for index, linge in df.items:
    print(index, ":", ligne.age, ligne.metier, ligne.sexe)

In [ ]:

# parcours d'une serie
for ligne in df.metier:
    print(ligne)

In [23]:
# boucle
for index, lignes in df.items():
    print(index)

age
sexe
metier
matricule

In [ ]:
for index, element in df.iterrows():
    if element.metier == "writer":
        print(index, element.metier, element.age, element.matricule)

In [ ]:
# affiche les metier de writer
df[df.metier == "writer"]

In [15]:
# les metier de writer ou les femmes
df[(df.metier == "writer") & (df.sexe == "F")]

       age sexe  metier matricule
index
122     32    F  writer     22206
236     44    F  writer     53214
264     36    F  writer     90064
389     44    F  writer     83702
390     42    F  writer     85016
491     43    F  writer     53711
503     50    F  writer     27514
504     40    F  writer     92115
507     18    F  writer     28450
518     49    F  writer     99709
557     30    F  writer     11217
558     56    F  writer     63132
617     27    F  writer     11201
620     18    F  writer     81648
668     29    F  writer     10016
736     48    F  writer     94618
796     32    F  writer     33755
798     40    F  writer     64131
911     37    F  writer     53210

In [ ]:
#  prendre les colonnes dont les metiers sont writer et technician
df[(df.metier == "writer") | (df.metier == "technician")]

In [ ]:
# filtre les age de plus de 20 ans
df[(df.age > 20)]

In [ ]:
#  trie de la colonne age par ordre dÃ©croisant
df.sort_values(by="age", ascending=False)

In [68]:
#  trie des colonnes age et sexe par ordre dÃ©croisant
df.sort_values(by=["age", "sexe"], ascending=False)

       age sexe         metier matricule
index
481     73    M        retired     37771
767     70    M       engineer     00000
803     70    M  administrator     78212
860     70    F        retired     48322
559     69    M      executive     10022
...    ...  ...            ...       ...
609     13    F        student     55106
674     13    F        student     55337
289     11    M           none     94619
471     10    M        student     77459
30       7    M        student     55436

[943 rows x 4 columns]

In [ ]:
#  inplace pour sauvegarder l'action
df2 = df.copy()
df2.sort_values(by=["age", "sexe"], ascending=False, inplace=True)
df2

In [40]:
#  trie des valeurs par ordre croissant sur la colonne age en ne prenant que les 10 premiers
df2[df2.sexe == "F"].sort_values(by="age").head(10).describe()

             age
count  10.000000
mean   14.500000
std     1.080123
min    13.000000
25%    14.000000
50%    14.500000
75%    15.000000
max    16.000000

In [45]:
df2 = df2.iloc[1, :1]
df2

age    70
Name: 767, dtype: object

In [44]:
# suppression 2 lignes
df2.drop([481, 482])
df2

       age sexe         metier matricule
index
481     73    M        retired     37771
767     70    M       engineer     00000
803     70    M  administrator     78212
860     70    F        retired     48322
559     69    M      executive     10022
...    ...  ...            ...       ...
609     13    F        student     55106
674     13    F        student     55337
289     11    M           none     94619
471     10    M        student     77459
30       7    M        student     55436

[943 rows x 4 columns]

In [ ]:
df2.drop(["age", "metier"], axis=1, inplace=False)

In [67]:
# df.head(10)
df3 = df.copy()
df3['sexe'].replace(
    {
        "M": "Homme",
        "F": "femme"
    }
)

index
1      Homme
2      femme
3      Homme
4      Homme
5      femme
       ...
939    femme
940    Homme
941    Homme
942    femme
943    Homme
Name: sexe, Length: 943, dtype: object